brew "libtiff"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "glib"
brew "cairo"
brew "colordiff"
brew "coreutils"
brew "diff-so-fancy"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "harfbuzz"
brew "openjdk"
brew "gradle"
brew "jenv"
brew "jq"
brew "less"
brew "neovim"
brew "nmap"
brew "openjdk@11"
brew "pyenv"
brew "railway"
brew "sox"
brew "telnet"
brew "terminalimageviewer"
brew "uv"
brew "vim"
cask "1password"
cask "1password-cli"
cask "activitywatch"
cask "aldente"
cask "beekeeper-studio"
cask "chatgpt"
cask "chromedriver"
cask "claude"
cask "claude-code"
cask "crossover"
cask "cursor"
cask "discord"
cask "disk-inventory-x"
cask "docker-desktop"
cask "dozer"
cask "flux-app"
cask "goland"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "kindle"
cask "ledger-live"
cask "lookaway"
cask "macwhisper"
cask "minecraft"
cask "nordvpn"
cask "notion"
cask "raycast"
cask "rekordbox"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "todoist-app"
cask "vimcal"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
