tap "4ier/tap"
tap "anthropics/tap"
tap "dicklesworthstone/tap"
tap "mieubrisse/agenc"
tap "mieubrisse/cmdk"
tap "mieubrisse/yappblocker"
tap "resend/cli"
# TIFF library and utilities
brew "libtiff"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Memory upgrade for your coding agent
brew "beads"
# Python code formatter
brew "black"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Clones a git repository and keeps it synchronized with the upstream
brew "git-sync"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Tool for glamorous shell scripts
brew "gum"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk@11"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Pretty-print tabular data in Python
brew "python-tabulate"
# Develop and deploy code with zero configuration
brew "railway"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOund eXchange: universal sound sample translator
brew "sox"
# User interface to the TELNET protocol
brew "telnet"
# Display images in a terminal using block graphic characters
brew "terminalimageviewer"
# Terminal multiplexer
brew "tmux"
# Official command-line interface for Todoist
brew "todoist-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Command-line interface for Resend
brew "resend/cli/resend", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Time tracker
cask "activitywatch"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Memory training application
cask "anki"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Tool to run Windows software
cask "crossover"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Tool to hide status bar icons
cask "dozer"
# Web browser
cask "firefox"
# Screen colour temperature controller
cask "flux-app"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Interface for reading and syncing eBooks
cask "kindle"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Break time reminder app
cask "lookaway"
# Speech recognition tool
cask "macwhisper"
# Sandbox construction video game
cask "minecraft"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Free Dj app to prepare and manage your music files
cask "rekordbox"
# Team communication and collaboration software
cask "slack"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# To-do list
cask "todoist-app"
# Calendar
cask "vimcal"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Voice-to-text dictation with AI-powered auto-editing
cask "wispr-flow"
# Video communication and virtual meeting platform
cask "zoom"
